Terraform Plan:

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # cloudflare_pages_domain.mirceanton-com will be created
  + resource "cloudflare_pages_domain" "mirceanton-com" {
      + account_id   = "0050c3889356460bb521dbab30c07065"
      + domain       = "mirceanton.com"
      + id           = (known after apply)
      + project_name = "mirceanton"
      + status       = (known after apply)
    }

  # cloudflare_pages_project.mirceanton will be created
  + resource "cloudflare_pages_project" "mirceanton" {
      + account_id        = "0050c3889356460bb521dbab30c07065"
      + created_on        = (known after apply)
      + domains           = (known after apply)
      + id                = (known after apply)
      + name              = "mirceanton"
      + production_branch = "main"
      + subdomain         = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

Plan saved to GH artifacts.